---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FormattedText
source: html/e74cf1df-845b-fcd2-01d3-005054467c53.htm
---
# FormattedText Members

Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.